{"pageProps":{"blogPost":{"title":"#GivingTuesdayNow","body":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"In these unusual times we have to stick together to come up with new, innovative ways to help veterans and double down on the methods that we know are working. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Due COVID-19 displacing education prospects for many veterans wanting to learn how to program due to the many code schools not able to certify those who weren’t previously enrolled, or they are simply looking for a higher quality of community that is focused on the goal of learning how to code, we have had an unprecedented amount of veterans and military spouses reach out to us for help to #RetoolRetrainRelaunch their careers to the future proof and for many of us coding at home, pandemic proof industry of coding. As such we are ramping up even more services and building more resources for veterans everywhere, regardless of admission. We recently started a  tutorial team that is building out educational resources for veterans on dev.to and we are revving up our media channel for live-streaming on youtube and podcasting to keep veterans engaged and informed.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Our troops have really stepped up to the plate. They are helping each other solve challenges, working together to build apps, deep diving in section of our curriculum to make themselves stronger devs, all while still handling the stress of day-to-day operations of being parents and workers during this unprecedented time.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This #GivingTuesdayNow we are asking you for a tax-deductible donation that will help us scale up resources even faster to support more veterans.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"author":{"authorName":"Jerome Hardaway","authorImage":{"url":"https://images.ctfassets.net/pkudqip5irxk/2Tguu2sRwvI12twQlAji1X/61438b809f7e1a8c0a6c9a17ccbeb2b0/jerome-medium.jpeg","width":240,"height":240}}}},"__N_SSG":true}