{"pageProps":{"blogPost":{"title":"The Teams Of #VetsWhoCode","body":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"As many of you know, we are unique in our process in that we don't charge our troops any money to learn from us at Vets Who Code. But that does not mean we are free. ","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Our veterans contribute by giving back to the community and by helping the organization by showcasing and using the skills we taught them in their everyday work lives and as mentors.  Using a threefold solution, our veterans get continued experience, constant support and motivation, and a team environment that makes all of VWC better.  Here are some of the teams that make VWC work.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Prework","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Led by a brilliant, very surly Marine, the prework team is the tip of our spear. It's the MEPS of VetsWhoCode in which you have to get through them to even get to our training. They decide who gets into VetsWhoCode by one metric - doing the work. As a free program, we make sure that every member goes through the prework to get into the cohort. It's our way of seeing who is serious and who is just playing with the idea of becoming a programmer.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Education","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"To me, this is an essential team, as we can't create any other group without them being trained by the Education team first. The Education team, or EDU, is the team that teaches the cohorts. What makes this team unique from other programs is that they are all not only veterans and programmers but former alumni that have gotten jobs through VWC.  No one knows how tough a challenge is better than people who have been through it and succeeded.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Code pen","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"If EDU is the most important, Codepen is my most fun. They are my rockstars, my special teams. They only have one mission: make eye-catching stuff for the web on ","nodeType":"text"},{"data":{"uri":"https://codepen.io/vetswhocode"},"content":[{"data":{},"marks":[],"value":"","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":"","nodeType":"text"},{"data":{"uri":"https://codepen.io/vetswhocode"},"content":[{"data":{},"marks":[],"value":"codepen","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":". It's usually around a subject and at least once a month, but when they debut their Codepen project, we're generally always featured, or picked pen. It's still a hit in the community and a great source of outreach for VetsWhoCode.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Product","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Our most reliable troops end up on the product team. Their job is to make the web app better continually. Our web app stack is the exact stack that they learn in the cohort ( we train what we know ).  The ramping up is minimal, but their work is appreciated. It's the only place where a couple of lines of code can be super impactful.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Tutorials","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The tutorials team is new, and they are kind of like our DevRel team. They have to know how to code but also how to write well enough to get their ideas across. This team is at the same level as the codepen team in regards to impact and exposure. You can view their work on our ","nodeType":"text"},{"data":{"uri":"https://dev.to/vetswhocode"},"content":[{"data":{},"marks":[],"value":"dev.to","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":" blog. I am excited to see what these troops can do.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Mentorship","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The mentorship team is the only team that outside programmers and civilians can join.  If you have been programming for a year and want to give back, this is where you need to be. You have to be a programmer with production-level experience in JavaScript with at least a year of experience and have a willingness to meet with your assigned troop at least twice a week.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"This Team of Teams is how we run VetsWhoCode, like a finely tuned operation that focuses on sectorized units with a front sight focus on their goals and projects. Not much different than the military, just on the internet.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"author":{"authorName":"Jerome Hardaway","authorImage":{"url":"https://images.ctfassets.net/pkudqip5irxk/2Tguu2sRwvI12twQlAji1X/61438b809f7e1a8c0a6c9a17ccbeb2b0/jerome-medium.jpeg","width":240,"height":240}}}},"__N_SSG":true}