{"pageProps":{"blogPost":{"title":"Vets Who Code: What, Where, And How to Help","body":{"json":{"data":{},"content":[{"data":{},"content":[{"data":{},"marks":[],"value":"When I started this journey ","nodeType":"text"},{"data":{},"marks":[{"type":"bold"}],"value":"SIX","nodeType":"text"},{"data":{},"marks":[],"value":" years ago, I just wanted to create an affordable solution for veterans to transition into the workforce as fast as they can without the hurdles of civilian life of trying to find a code school that accepts the GI Bill. I didn’t want my fellow troops in transition to fall through the cracks, like I did.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"That’s why I went into the nonprofit sector in the first place. I wanted to help my brothers and sisters. What I found was a system designed, not to help them, but, to get as much money out of donors, sponsors and government agencies as possible by telling the story of how the nation fails our servicemen and women; all the while creating extremely high requirements, yet, having extremely low benchmarks for success. Did you know that unless you are actually sleeping on the streets in some states you aren’t considered homeless? Meaning, if you are living out of your car, living out of a hotel room, or couch-surfing, you don’t qualify for certain support services.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"I should know — I’ve had the great displeasure of doing all three. Despite the adversity, perseverance enabled me to climb out of the darkness, with a deep desire to keep other veterans from falling into the abyss. Thinking back, that was the hardest six months of my life! It was development and design that helped me get through those tough times, not the current nonprofit sector filled with relics that have cozy relationships all the while doing the minimum.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"I spent every waking moment learning skills that other people were either too stubborn or just too fearful to learn, and it added value to me — value the civilian sector could understand. Then, when a fallen soldier’s family needed help, my newly minted value empowered me to answer the call to bury a brother. Afterwards, I was like “what do I do next?” — leading to the stupid idea of turning something old (a freaking castle!) into something new, repurposing it to retrain veterans in real and digital skillsets. Unfortunately that didn’t work. But, out of it came true inspiration, something revamped, brilliant, and functional — something I hope would even make David Heinemeier Hansson (my hero) proud.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"What is Vets Who Code?","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Vets Who Code is a veteran founded, lead and operated 501(c)(3) distributed charitable non-profit, dedicated to filling the wide chasm between technical expertise needed and available with transitioning veterans and active duty military spouses through software development training and education. We utilize our distributed model for the capability to train veterans anywhere, but we are so much more. We are a team of people with hybrid tech skills and a lean mentality, focused on helping veterans not only learn how to program, but get jobs in the field and to do it without the unnecessary bloat that other nonprofits take on. From UX and DevOPs engineers to little old me, who got thrown into this because I simply wanted to help my fellow veterans, which is the most important part of this nonprofit. Currently 80% of the team is veterans, and we provide what you need to surpass our successes and learn from our mistakes. ’Cause if we are to celebrate this thing called life, we need to be there together.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"Why Code?","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"Great question. Right now our country has a problem: we have programming jobs, but not enough programmers. Not only that, we don’t have enough GOOD programmers. On top of that, while it’s definitely better, veterans are still the highest unemployed demographic in America. So we had this crazy idea. What if we created a vetted curriculum designed around modern technologies? Not just any veterans, those who this skill could really impact. Not only that, let’s work tirelessly to mentor them in professional standards of code, business, and design. Can you imagine how much better you get at design thinking when the guy speaking has been thinking about it every day for the last 15 years? We then thought, what if we added tools to continue learning after you’ve dealt with us for 15 weeks? Our partners like Frontend Masters and Google Cloud give us amazing tools to gift the veterans so that they can learn and prep for up to a year. Not only that — we make introductions, and train them in the interview process to help them get jobs in the industry. You know what? It works. Our troops have been getting highly paid positions, and we couldn’t be happier. Here we empower amazing people to have the lifestyle they have earned, and we do it all online; a feat that wasn’t even possible 10 years ago.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"How Can You Help?","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"That’s actually a question we get quite often. Our veterans spend 15 weeks with our team focusing on the language JavaScript and and all it encompasses, and understanding software architecture and computer science fundamentals. We focus on having workflows, interview questions, computer science, and UX research.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"The most important thing you can do to support our mission is ","nodeType":"text"},{"data":{"uri":"https://donorbox.org/vetswhocode-donation"},"content":[{"data":{},"marks":[{"type":"bold"}],"value":"donate","nodeType":"text"}],"nodeType":"hyperlink"},{"data":{},"marks":[],"value":". As a 501(c)(3) we are tax-deductible, and as a distributed non-profit, we don't have any wasteful operating cost. All proceeds go directly to resources and cool things for the troops.","nodeType":"text"}],"nodeType":"paragraph"},{"data":{},"content":[{"data":{},"marks":[],"value":"If you’re a software engineer with at least two years experience working with ES6 and Javascript, sign up as a mentor. If you are a designer who can code, we are always looking for someone to help us with our user experience. If you are in HR, drop us a line in our contact form, so that we can get our troops into your pipeline for javascript jobs.","nodeType":"text"}],"nodeType":"paragraph"}],"nodeType":"document"}},"author":{"authorName":"Jerome Hardaway","authorImage":{"url":"https://images.ctfassets.net/pkudqip5irxk/2Tguu2sRwvI12twQlAji1X/61438b809f7e1a8c0a6c9a17ccbeb2b0/jerome-medium.jpeg","width":240,"height":240}}}},"__N_SSG":true}